IDEA Open Model
ConnectionSetup.AnchorLengthForStiffness Property
Compatible with IDEA StatiCa v 10.1
 Length of anchor to define the anchor stiffness in analysis model, as a multiple of anchor diameter (E A /n * [d])
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public int AnchorLengthForStiffness { get; set; }
Public Property AnchorLengthForStiffness As Integer
	Get
	Set
public:
property int AnchorLengthForStiffness {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace